// Варіант №15 

// В одному загадковому саду на окремих n (2≤n≤100) галявинах були висаджені дивовижні квіти. 
// Їх запах був особливим і садівник поділяв їх на дві групи – гострі та солодкі. 
// Насиченість цих запахів він позначав відповідно цілими від’ємними та додатними числами.
// Для визначення насолоди від прогулянки між цими галявинками він визначав модуль суми
// двох сусідніх галявин під час такого обходу. 
// Визначити мінімальну послідовність пар галявин, якими має пройти садівник,
// щоб відвідати всі ці галявини та отримати максимальне сумарне задоволення.   

#include "Graph.h"
#include "Graph.cpp"
#include <iostream>
#include <fstream>
using std::ifstream;
using namespace std;
#include <cstdlib>

int main()
{
    Graph graph;
    int max;

    max = graph.find_the_answer();
    cout << "max is " << max;
}