// Варіант №15

// Мер одного з міст у своїй передвиборчій кампанії пообіцяв заасфальтувати дороги у місті за власний кошт.
// Відома карта міста, де вказано m (1≤m≤1000) доріг та їх довжину,
// які з’єднують між собою певним чином n (2≤n≤100) перехресть.
// Після виборів обраний мер вирішив зекономити і заасфальтувати лише частину доріг. 
// Допоможіть йому визначити, між якими двома перехрестями варто заасфальтувати дороги,
// щоб їх кількість була більша 1, а вартість найменшою

#include "Graph.h"
#include "Graph1.cpp"
#include <iostream>
#include <fstream>
using std::ifstream;
using namespace std;
#include <cstdlib>

int main()
{
    Graph graph;
    int max;

    max = graph.find_the_answer();
    cout << "min is " << max;
}

