import numpy as np
import random

def interval(x):
    '''РџРѕРІРµСЂС‚Р°С” СЂС–Р·РЅРёС†СЋ РјС–Р¶ РјР°РєСЃРёРјР°Р»СЊРЅРёРј С‚Р° РјС–РЅС–РјР°Р»СЊРЅРёРј РµР»РµРјРµРЅС‚РѕРј СЃРїРёСЃРєСѓ
    '''
    return max(x) - min(x)

def np_interval(a):
    '''РџРѕРІРµСЂС‚Р°С” СЂС–Р·РЅРёС†СЋ РјС–Р¶ РјР°РєСЃРёРјР°Р»СЊРЅРёРј С‚Р° РјС–РЅС–РјР°Р»СЊРЅРёРј РµР»РµРјРµРЅС‚РѕРј РјР°СЃРёРІСѓ numpy
    '''
    return np.max(a) - np.min(a)



n = int(input('РљС–Р»СЊРєС–СЃС‚СЊ РµР»РµРјРµРЅС‚С–РІ: '))

x = [random.random() for i in range(n)]
print('СЃС‚РІРѕСЂРµРЅРѕ СЃРїРёСЃРѕРє')
print('С–РЅС‚РµСЂРІР°Р»', interval(x))

a = np.array(x)
print('СЃС‚РІРѕСЂРµРЅРѕ РјР°СЃРёРІ numpy')
print('numpy - С–РЅС‚РµСЂРІР°Р»', np_interval(a))
