// Робота Куриляка Назарія (211 група)
//Стек заповнений однозначними і двозначними числами.Помістити однозначні числа в початок стека, двозначні - в кінець.
//Створити копію черги, елементи якої розміщені у зворотному порядку. Організувати перегляд елементів черги.
#include <cstdlib>
#include <iostream>

using namespace std;

int main()
{
    int n, i, j, swapper, head = -1;
    int *a, *reversed; 
    srand(time(NULL));
    
    cout << "Inpun N ";
    cin >> n;
    a = new int[n];
    reversed = new int[n];

    while (++head < n){ // заповнення випадковим чином по умові: "Стек заповнений однозначними і двозначними числами."
        a[head] = rand() % 30;
    }

    for (i = 0; i < n; i++){ // вивід масиву а
        cout << a[i] << " ";
    }

    cout << "\n" << "Stack: \n";
    head--;

    do{ // вивід стеку на основі масиву а 
        cout << a[head] << " ";
    } while (head-- > 0);

    cout << "\n";
    cout << "Stack new: \n";
    for(i = 0, j = 0; i < n; i++){ // виконання умови:  "Помістити однозначні числа в початок стека, двозначні - в кінець."
        if (a[i] / 10 < 1){
            swapper = a[i];
            a[i] = a[j];
            a[j] = swapper;
            j++; 
        }
    }
    head = 0;
    do{ // вивід стеку після виконання умови
        cout << a[head] << " ";
    } while (++head < n);
    
    for(i = 0, j = n-1; i < n; i++, j--){// виконання умови: "Створити копію черги, елементи якої розміщені у зворотному порядку."
        reversed[j] = a[i];
    }
    cout << "\nreversed:" << endl;
    head = 0;
    do{ // виконання умови: "Організувати перегляд елементів черги."
        cout << reversed[head] << " ";
    } while (++head < n);

    cout << "\n";
}
