{
    "info": [
        {
            "title": "Cat found wandering the cabin aisles on flight",
            "text": "A grey and white cat was found wandering the cabin aisles on a recent JetBlue flight, to the surprise of passengers onboard. Author and columnist Yi Shun Lai shared a photograph on Twitter of the cat being held aloft by a flight attendant on her recent flight in an effort to reunite the creature with its owner. “On last night's @JetBlue flight, ONT-JFK: 'Is anyone missing a CAT. A grey-and-white CAT.' Yes I woke up for this,” Lai wrote alongside the image."
        },
        {
            "title": "New rules makes microchipping for cats in England compulsory",
            "text": "All pet cats in England must be microchipped under a new law which could see their owners face a £500 fine if they do not get it done. Millions of cats are set to be inserted with the small electronic device by June 2024 after the compulsory cat microchipping legislation was introduced in Parliament on Monday."
        },
        {
            "title": "Huge surge in abandoned cats and dogs as RSPCA urges struggling owners to use pet food banks",
            "text": "The cost of living crisis is forcing increasing numbers of owners to hand over their pets to charities and rescue organisations as food bills and vets’ fees rise. Older people and middle-income earners are the largest groups giving up their cats, The Independent can reveal. Caseloads at both Dogs Trust and Cats Protection are at record levels, while RSPCA officers are dealing with 25 per cent more abandonments year on year. And it comes as struggling owners are being encouraged to use pet food banks to feed their animals as costs become prohibitively high for many people. Cats Protection says it experienced a 90 per cent increase in older people passing on their cats in 2022 compared with the year before. Some 400 older owners asked Cats Protection to take on their cat, exacerbating waiting lists of animals needing rehoming. The charity used modelling based on handover data to judge which sorts of owners were worst hit by the inflation crisis, and it found a 44 per cent increase – to 900 – in families handing over cats to the charity last year. Numbers of young single people giving up cats rose 58 per cent to 200. Meanwhile, owners asking the Dogs Trust charity to take their pet went up by 19 per cent last month alone, from 42,000 in November."
        },
        {
            "title": "Cats first bonded with humans after invention of farming, study decodes",
            "text": "Humans developed close bonds with cats after they first made the switch from hunter-gatherers to farmers nearly 10,000 years ago as the felines began serving as pest control in the first civilizations, a new study confirms. The research, published recently in the journal Heredity, suggests the world’s first domestication of cats was sparked by this lifestyle transition that led to humans establishing increasingly larger settlements after inventing agriculture. Wildcats that lived about 12,000 years ago capitalised on the increased density of rodents around the first grain stores and early human societies also benefited from cats preying on these vermin, researchers from the University of Missouri in the US explained. Cat domestication initiated as a mutually beneficial relationship between wildcats and the peoples of developing agrarian societies in the Fertile Crescent – a crescent-shaped region in the Middle East that includes modern-day Syria, Iraq, Lebanon, Palestine, Israel and Jordan. In the study, scientists collected and analysed DNA from cats in and around the Fertile Crescent area, as well as throughout Europe, Asia and Africa."
        },
        {
            "title": "Cat burglars who stole 150 felines for meat arrested in China",
            "text": "Members of a gang of cat thieves in China have been arrested for stealing 150 felines by using sparrows so they could be sold for meat. A total of 148 cats stuffed inside seven cages, alongside 31 sparrows, were recovered by police officials from Shandong province’s Jinan city, said global animal rights body Humane Society International (HSI), citing Chinese animal protection group VShine. Two kittens were born from the captured cats after the rescue operation was over, officials said. Many of the cats – captured so they could be sent to slaughterhouses later – were found to be emaciated and crying out, animal protection group officials said."
        },
        {
            "title": "Polish scientists spark uproar by labelling cats an invasive alien species",
            "text": "A Polish scientific institute has added domestic cats to its national database of “invasive alien species”, causing fur to fly as animal lovers sought to defend their beloved pets. Felis catus, the scientific name for the common house cat, was added to the database earlier this month. The database already had 1,786 other species listed with no objections, reported the Associated Press on Tuesday."
        },
        {
            "title": "Jasper and Willow jointly crowned ‘cats of the year’ for bringing ‘comfort’ to hospice",
            "text": "Two rescue cats who live in a hospice have been named joint National Cats of the Year 2022 for the “comfort and support they bring to people at the end of their life”. Brother and sister pair, Jasper and Willow, won the prestigious award for the joy they bring to the people in St Peter and St James Hospice in Haywards Heath, West Sussex. In 2018, the felines were adopted by the hospice to provide some companionship to those receiving end of life care."
        },
        {
            "title": "Woman travels the world for free by catsitting",
            "text": "An Australian woman has revealed how you can travel the world for free by catsitting. Madolline Gourley, 31, has toured across Oz and the US for next to nothing by offering her housesitting services and looking after people’s pets while they’re away. The enterprising writer, originally from Brisbane, says she’s saved around A$28,000 (£16,050) in accommodation costs to date by using site TrustedHouseSitters. She has even started a blog – titled One Cat at a Time – in which she shares updates on her trips and pictures of cute cats, plus gives others travel tips to follow in her footsteps."
        }
    ]
}