import math

# формула з умови завдання
def c(t):
    return 5 + 0.5 * t * math.sin(t**2)

# реалізація методу сімпсона
def composite_simpson(a, b, h):
    # знаходження кількості підінтервалів між початком та кінцем інтегралу
    n = int((b - a) / h)
    # закидуємо в наш накопичувач розв'язок з початку інтегралу та з кінця
    integral = c(a) + c(b)

    # далі проходимося по кожному підінтервалу, також роз'язуємо його по формулі та закидуємо в наш накопичувач
    for i in range(1, n):
        x = a + i * h
        # якщо підінтервал парний то у формулі буде 2
        if i % 2 == 0:
            integral += 2 * c(x)
        # якщо підінтервал непарний то у формулі буде 4    
        else:
            integral += 4 * c(x)

    return integral * h / 3

a = 0
b = 2

h1 = 0.01  # Перший крок
result1 = composite_simpson(a, b, h1)
print(f"Кількість теплоти з кроком {h1}: {result1}")

h2 = 0.001  # Другий крок
result2 = composite_simpson(a, b, h2)
print(f"Кількість теплоти з кроком {h2}: {result2}")
