// Варіант №15

// Закоханий студент хоче провести свою кохану через усі кав’ярні міста.
// Він пообіцяв дорогою між будь-якими двома кав’ярнями у кожної квіткарки купувати по одній троянді.
// Оскільки він не може зекономити на кав’ярнях, по залишається лише мінімізувати кількість куплених троянд. 
// Допоможіть студенту знайти такий шлях відвідування кав’ярень, який максимально зекономить його кошти на купівлі троянд.
// Відомо, що у місті є n (1<n≤100) кав’ярень та m (1≤m≤1000) можливих переходів між ними. 
// На кожному такому переході (i,j), де i,j=1,2,3…,n, стоять w квіткарок троянд.